Repository: SergeyVladimirovichRu/matrix-effect
Catalog: languages/matrix-effect-*.po
Languages: ru_ru

source: Matrix Effect Settings
ru_ru: Настройки эффекта Матрицы

source: Text Color
ru_ru: Цвет текста

source: Select the text color for matrix effect
ru_ru: Выберите цвет текста для эффекта Матрицы

source: Animation speed (1-10)
ru_ru: Скорость анимации (1-10)

source: The higher the number, the higher the speed.
ru_ru: Чем выше число, тем выше скорость.

source: Turn on pause
ru_ru: Включить паузу

source: By turning it on you will be able to stop the matrix effect.
ru_ru: При включении эффекта можно будет его остановить.

source: Print speed (ms)
ru_ru: Скорость печати (мс)

source: 1 - the highest speed
ru_ru: 1 - самая высокая скорость

source: Font size of falling characters (px)
ru_ru: Размер шрифта падающих символов (px)

source: Font size for falling matrix symbols
ru_ru: Размер шрифта для падающих символов матрицы

source: Transparency of symbols (0.1-1)
ru_ru: Прозрачность символов (0.1-1)

source: Set the transparency of the falling symbols (1 - fully opaque
ru_ru: Установите прозрачность падающих символов (1 - полностью непрозрачные

source: Text block background color
ru_ru: Цвет фона текстового блока

source: Select a background color for the text block
ru_ru: Выберите цвет фона для блока с текстом

source: Cursor style
ru_ru: Стиль курсора

source: blinking
ru_ru: мигающий

source: static
ru_ru: Статичный

source: underline
ru_ru: подчеркивание

source: What will your cursor look like
ru_ru: Как будет выглядеть ваш курсор?

source: Flashing speed (ms)
ru_ru: Скорость мигания (мс)

source: 1 - very fast cursor blinking speed
ru_ru: 1 - очень быстрая скорость мигания курсора

source: Word frequency (sec)
ru_ru: Частота появления слов (сек)

source: Word appearance interval (0 - disable effect)
ru_ru: Интервал появления слов (0 - отключить эффект)

source: Word size (px)
ru_ru: Размер слов (px)

source: Size of words appearing
ru_ru: Размер появляющихся слов

source: Disable on pages
ru_ru: Отключать на страницах

source: Page IDs separated by commas where to disable the effect
ru_ru: ID страниц через запятую, где отключать эффект

source: Disable for post types
ru_ru: Отключать для типов записей

source: Where not to show the effect
ru_ru: Где не показывать эффект

source: Selective switching mode
ru_ru: Режим избирательного включения

source: If enabled, the effect will ONLY work on the pages below
ru_ru: Если включено, эффект будет работать ТОЛЬКО на указанных ниже страницах

source: Pages to enable effect
ru_ru: Страницы для включения эффекта

source: Page IDs separated by commas (for example: 5,12,18)
ru_ru: ID страниц через запятую (например: 5,12,18)

source: Example: 5,12,18
ru_ru: Пример: 5,12,18

source: The effect will ONLY work on the specified pages (ignoring other settings). If you clicked the checkbox and did not specify the page ID, the effect will be disabled on all pages.
ru_ru: Эффект будет работать ТОЛЬКО на указанных страницах (игнорируя другие настройки). Если вы нажали на чекбокс и не указали ID страницы, то эффект будет отключен на всех страницах.

source: Transparency:
ru_ru: Прозрачность:

source: Customize the appearance and behavior of the Matrix Effect
ru_ru: Настройте внешний вид и поведение Matrix Effect

source: Replaces standard text with a matrix effect with a typewriter, disabling it from forms and by id.
ru_ru: Заменяет стандартный текст на эффект матрицы с печатной машинкой с отключением от форм и по id.
